In [2]:
import numpy as np
import pandas as pd

In [2]:
# age list
state=['Lagos','Delta','Kaduna']

In [3]:
# state list
stat_dict={
'Lagos':"Ikeja",
"Delta":"Asaba",
"Kaduna":"Kadunda"
}

In [4]:
age=[40,17,18,35,25]
ser1=pd.Series(age)
ser2=pd.Series(state)
ser3=pd.Series(stat_dict)

In [5]:
ser2

0     Lagos
1     Delta
2    Kaduna
dtype: object

In [6]:
ser3

Lagos       Ikeja
Delta       Asaba
Kaduna    Kadunda
dtype: object

In [7]:
ser1

0    40
1    17
2    18
3    35
4    25
dtype: int64

In [8]:
# Mapping

In [9]:
ser2.map(ser3)

0      Ikeja
1      Asaba
2    Kadunda
dtype: object

In [15]:
country=["Nigeria","India","America","Ivory Coast"]

In [30]:
capital={"Nigeria":"Abuja","India":"New Delhi","America":"New York","Ivory Coast":"Abidjan"}

In [31]:
capital

{'Nigeria': 'Abuja',
 'India': 'New Delhi',
 'America': 'New York',
 'Ivory Coast': 'Abidjan'}

In [32]:
country=pd.Series(country)
capital=pd.Series(capital)

In [33]:
country

0        Nigeria
1          India
2        America
3    Ivory Coast
dtype: object

In [34]:
capital

Nigeria            Abuja
India          New Delhi
America         New York
Ivory Coast      Abidjan
dtype: object

In [35]:
country.map(capital)

0        Abuja
1    New Delhi
2     New York
3      Abidjan
dtype: object

In [ ]:
# Using the lambda anonymous function

In [38]:
ser1.map(lambda x:x+1)

0    41
1    18
2    19
3    36
4    26
dtype: int64

In [39]:
#Taking a look at the apply method
# Using an anonymous function that calculate and groups the function 
# into a class

In [40]:
def age_classify(age):
    if age<18:
        return "Teenagers"
    else:
        return "Adult"

In [41]:
print(age_classify(14))

Teenagers

In [42]:
print(age_classify(25))

Adult

In [43]:
'''Now using the apply()'''
ser1.apply(age_classify)

0        Adult
1    Teenagers
2        Adult
3        Adult
4        Adult
dtype: object

In [44]:
ser1.apply(lambda x:x+1)

0    41
1    18
2    19
3    36
4    26
dtype: int64

In [3]:
array=np.array([[1,2,3],[4,5,6]])

In [4]:
array

array([[1, 2, 3],
       [4, 5, 6]])

In [5]:
pd.DataFrame(array,columns=['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6

In [7]:
# creating dataframe from a list
a_list=[{'a':1,'b':2,'c':3},
       {'a':4,'b':5,'c':6}]

In [9]:
pd.DataFrame(a_list)

   a  b  c
0  1  2  3
1  4  5  6

In [10]:
a_list=[{'a':1,'b':2,},
       {'a':4,'b':5,'c':6}]

In [11]:
pd.DataFrame(a_list)

   a  b    c
0  1  2  NaN
1  4  5  6.0

In [17]:
df=pd.read_csv("students.csv")

In [18]:
df

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
2,Sesan Obi,24,Swimming,67.0,95.0,71.0
3,Kevin Frank,25,Tennis,53.0,85.0,74.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
6,Franklin Oladele,18,Football,96.0,NaN,70.0
7,Kola Ola,28,Swimming,82.0,95.0,58.0
8,Emmanuel Ovi,23,Tennis,79.0,61.0,68.0
9,Kareem Musa,24,Football,78.0,73.0,86.0
10,Mustapha Ahmed,24,NaN,88.0,84.0,NaN
11,Femi Akin,24,Tennis,90.0,97.0,85.0
12,Tobi Olaniyan,22,Volleyball,51.0,79.0,84.0
13,Kayode Ibrahim,25,Football,58.0,67.0,84.0
14,Nnamdi Ike,26,Swimming,NaN,62.0,88.0
15,Ahmed Musa,24,Football,60.0,90.0,81.0
16,Kevin Frank,25,Tennis,53.0,85.0,74.0
17,Susan James,27,Volleyball,76.0,69.0,54.0
18,Zainab Mohammed,25,Basketball,64.0,95.0,94.0
19,Sesan Obi,26,Swimming,67.0,95.0,71.0

In [24]:
df.head()

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
2,Sesan Obi,24,Swimming,67.0,95.0,71.0
3,Kevin Frank,25,Tennis,53.0,85.0,74.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0

In [23]:
df.tail()

,name,age,sport,Biology_score,Maths_score,English_score
15,Ahmed Musa,24,Football,60.0,90.0,81.0
16,Kevin Frank,25,Tennis,53.0,85.0,74.0
17,Susan James,27,Volleyball,76.0,69.0,54.0
18,Zainab Mohammed,25,Basketball,64.0,95.0,94.0
19,Sesan Obi,26,Swimming,67.0,95.0,71.0

In [25]:
df.describe()

             age  Biology_score  Maths_score  English_score
count  20.000000      19.000000    19.000000      19.000000
mean   24.600000      73.947368    78.789474      76.789474
std     2.161871      14.717615    13.930697      11.033177
min    18.000000      51.000000    56.000000      54.000000
25%    24.000000      62.000000    68.000000      70.500000
50%    24.500000      76.000000    80.000000      79.000000
75%    26.000000      87.000000    92.500000      84.500000
max    28.000000      96.000000    97.000000      94.000000

In [31]:
df_n=df[['age','Biology_score']]

In [32]:
df_n

    age  Biology_score
0    27           73.0
1    24           92.0
2    24           67.0
3    25           53.0
4    24           86.0
5    27           92.0
6    18           96.0
7    28           82.0
8    23           79.0
9    24           78.0
10   24           88.0
11   24           90.0
12   22           51.0
13   25           58.0
14   26            NaN
15   24           60.0
16   25           53.0
17   27           76.0
18   25           64.0
19   26           67.0

In [41]:
array=np.arange(15).reshape(5,3)

In [42]:
array

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [43]:
index=['A','B','C','D','E']
columns=['col1','col2','col3']

In [44]:
df=pd.DataFrame(array,index=index, columns=columns)

In [45]:
df

   col1  col2  col3
A     0     1     2
B     3     4     5
C     6     7     8
D     9    10    11
E    12    13    14

In [46]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [47]:
df.shape

(5, 3)

In [49]:
df.describe()

            col1       col2       col3
count   5.000000   5.000000   5.000000
mean    6.000000   7.000000   8.000000
std     4.743416   4.743416   4.743416
min     0.000000   1.000000   2.000000
25%     3.000000   4.000000   5.000000
50%     6.000000   7.000000   8.000000
75%     9.000000  10.000000  11.000000
max    12.000000  13.000000  14.000000

In [52]:
df.dtypes

col1    int32
col2    int32
col3    int32
dtype: object

In [53]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [54]:
df.axes

[Index(['A', 'B', 'C', 'D', 'E'], dtype='object'),
 Index(['col1', 'col2', 'col3'], dtype='object')]

In [55]:
df.head()

   col1  col2  col3
A     0     1     2
B     3     4     5
C     6     7     8
D     9    10    11
E    12    13    14

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
dtypes: int32(3)
memory usage: 100.0+ bytes

In [58]:
df.reset_index(inplace=True)

In [59]:
df

  index  col1  col2  col3
0     A     0     1     2
1     B     3     4     5
2     C     6     7     8
3     D     9    10    11
4     E    12    13    14

  index  col1  col2  col3
0     A     0     1     2
1     B     3     4     5
2     C     6     7     8
3     D     9    10    11
4     E    12    13    14

In [61]:
# How to select data by their index
# iloc
# loc

In [63]:
df=pd.read_csv('students.csv')

In [64]:
df.head()

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
2,Sesan Obi,24,Swimming,67.0,95.0,71.0
3,Kevin Frank,25,Tennis,53.0,85.0,74.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0

In [65]:
df.describe()

             age  Biology_score  Maths_score  English_score
count  20.000000      19.000000    19.000000      19.000000
mean   24.600000      73.947368    78.789474      76.789474
std     2.161871      14.717615    13.930697      11.033177
min    18.000000      51.000000    56.000000      54.000000
25%    24.000000      62.000000    68.000000      70.500000
50%    24.500000      76.000000    80.000000      79.000000
75%    26.000000      87.000000    92.500000      84.500000
max    28.000000      96.000000    97.000000      94.000000

In [66]:
df['name']
# This gives you a series

0     Emmanuel Ayomide
1         Ibrahim Musa
2            Sesan Obi
3          Kevin Frank
4           Emeka Jude
5         Caroline Obi
6     Franklin Oladele
7             Kola Ola
8         Emmanuel Ovi
9          Kareem Musa
10      Mustapha Ahmed
11           Femi Akin
12       Tobi Olaniyan
13      Kayode Ibrahim
14          Nnamdi Ike
15          Ahmed Musa
16         Kevin Frank
17         Susan James
18     Zainab Mohammed
19           Sesan Obi
Name: name, dtype: object

In [68]:
df[['name','sport']]
# This gives you a dataframe

                name       sport
0   Emmanuel Ayomide    Football
1       Ibrahim Musa    Football
2          Sesan Obi    Swimming
3        Kevin Frank      Tennis
4         Emeka Jude  Basketball
5       Caroline Obi  Basketball
6   Franklin Oladele    Football
7           Kola Ola    Swimming
8       Emmanuel Ovi      Tennis
9        Kareem Musa    Football
10    Mustapha Ahmed         NaN
11         Femi Akin      Tennis
12     Tobi Olaniyan  Volleyball
13    Kayode Ibrahim    Football
14        Nnamdi Ike    Swimming
15        Ahmed Musa    Football
16       Kevin Frank      Tennis
17       Susan James  Volleyball
18   Zainab Mohammed  Basketball
19         Sesan Obi    Swimming

In [69]:
df.iloc[14]

name             Nnamdi Ike
age                      26
sport              Swimming
Biology_score           NaN
Maths_score            62.0
English_score          88.0
Name: 14, dtype: object

In [70]:
df.loc[14]

name             Nnamdi Ike
age                      26
sport              Swimming
Biology_score           NaN
Maths_score            62.0
English_score          88.0
Name: 14, dtype: object

In [71]:
df.iloc[0:9,0]

0    Emmanuel Ayomide
1        Ibrahim Musa
2           Sesan Obi
3         Kevin Frank
4          Emeka Jude
5        Caroline Obi
6    Franklin Oladele
7            Kola Ola
8        Emmanuel Ovi
Name: name, dtype: object

In [74]:
df.loc[0:8,'sport']

0      Football
1      Football
2      Swimming
3        Tennis
4    Basketball
5    Basketball
6      Football
7      Swimming
8        Tennis
Name: sport, dtype: object

In [78]:
df.iloc[0:9,[0,3]]

               name  Biology_score
0  Emmanuel Ayomide           73.0
1      Ibrahim Musa           92.0
2         Sesan Obi           67.0
3       Kevin Frank           53.0
4        Emeka Jude           86.0
5      Caroline Obi           92.0
6  Franklin Oladele           96.0
7          Kola Ola           82.0
8      Emmanuel Ovi           79.0

In [79]:
df.loc[0:8,['name','Biology_score']]

               name  Biology_score
0  Emmanuel Ayomide           73.0
1      Ibrahim Musa           92.0
2         Sesan Obi           67.0
3       Kevin Frank           53.0
4        Emeka Jude           86.0
5      Caroline Obi           92.0
6  Franklin Oladele           96.0
7          Kola Ola           82.0
8      Emmanuel Ovi           79.0

In [88]:
# Filtering data

dff=df['Biology_score']>=70

In [89]:
df[dff]

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
6,Franklin Oladele,18,Football,96.0,NaN,70.0
7,Kola Ola,28,Swimming,82.0,95.0,58.0
8,Emmanuel Ovi,23,Tennis,79.0,61.0,68.0
9,Kareem Musa,24,Football,78.0,73.0,86.0
10,Mustapha Ahmed,24,NaN,88.0,84.0,NaN
11,Femi Akin,24,Tennis,90.0,97.0,85.0
17,Susan James,27,Volleyball,76.0,69.0,54.0

In [96]:
df[(df['Biology_score']>=70)&(df['Maths_score']>=70)&(df['English_score']>=70)]

            name  age       sport  Biology_score  Maths_score  English_score
4     Emeka Jude   24  Basketball           86.0         80.0           93.0
5   Caroline Obi   27  Basketball           92.0         71.0           79.0
9    Kareem Musa   24    Football           78.0         73.0           86.0
11     Femi Akin   24      Tennis           90.0         97.0           85.0

In [93]:
df[dff]

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
6,Franklin Oladele,18,Football,96.0,NaN,70.0
7,Kola Ola,28,Swimming,82.0,95.0,58.0
8,Emmanuel Ovi,23,Tennis,79.0,61.0,68.0
9,Kareem Musa,24,Football,78.0,73.0,86.0
10,Mustapha Ahmed,24,NaN,88.0,84.0,NaN
11,Femi Akin,24,Tennis,90.0,97.0,85.0
17,Susan James,27,Volleyball,76.0,69.0,54.0